/* 
JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений.
 Наиболее широкое применение находит в браузерах как язык сценариев для придания интерактивности веб-страницам.

Основные архитектурные черты: динамическая типизация, слабая типизация, автоматическое управление памятью, 
прототипное программирование, функции как объекты первого класса.

На JavaScript оказали влияние многие языки, при разработке была цель сделать язык похожим на Java. 
Языком JavaScript не владеет какая-либо компания или организация, что отличает его от ряда языков программирования, 
используемых в веб-разработке.
*/

// number, string, boolean, object, null, 



//1 Создай переменную с именем emptyList, в которой будет пустой массив.
// let emptyList = []; 

//2 Создай переменную с именем dataTypes, в которой будет массив с названиями типов данных.
// let dataTypes = ['number', 'string', 'boolean', 'object', null, 'bigint', 'symbol', undefined];

//3 Создай переменную с именем dataTypesExample, в которой будет массив со значениями из разных типов данных.
//  let dataTypesExample = [21, 'привет', true, undefined, null, 1234567890123456789012345678901234567890n, ]

 //4 Создай переменную с именем booleanDataType, в которой будет массив с двумя значениями логического типа.
//  let booleanDataType =false, true;

//5 Создай переменную с именем collection, в которой будет три пустых объекта.
//  let collection = {}, {}, {};


 //6 Создай переменную с именем application и опиши в нём приложение, в котором проводишь больше всего времени. 
 //Постарайся использовать как можно больше типов данных, вложенный объект и массив (ниже есть пример).

//  let application = {
//     name: 'youtube',
//     isItFree: true,
//     developer: {
//       name: 'google',
//       location: 'usa',
//       realisedYear:2005,
//     },
//     function: ['просмотр и поиск видео', 'комментарии', 'загрузка видео', 'настройки'],

//  };

//  console.log(application);


//7 Приведи пример использования условных выражений (if-else).
// let a = 5;
// let b = 8;

//     if (a == b) {
//       console.log('неверно');
//     } else {
//       console.log('верно');
//     }



//8 Создай функцию с именем startGame, 
//которая принимает параметр с именем playersCount и возвращает текст "Игра началась. Количество игроков: playersCount".

// function startGame(playersCount) {
//    return 'Игра началась. Количество игроков: playersCount'
// }
// console.log(startGame())